# Орел и решка
# Дана строка текста, состоящая из букв русского алфавита "О" и "Р". Буква "О" – соответствует выпадению Орла,
# а буква "Р" – соответствует выпадению Решки. Напишите программу, которая подсчитывает наибольшее 
# количество подряд выпавших Решек.
# Формат входных данных
# На вход программе подается строка текста, состоящая из букв русского алфавита "О" и "Р".
# Программа должна вывести наибольшее количество подряд выпавших Решек.
# Примечание. Если выпавших Решек нет, то необходимо вывести число
# 0
# 0.

# Тестовые данные 🟢
# Sample Input 1:
# ОРРОРОРООРРРО
# Sample Output 1:
# 3
# Sample Input 2:
# ООООООРРРОРОРРРРРРР
# Sample Output 2:
# 7
# Sample Input 3:
# ООООРРРРОРОРРРРРРРРООРОРОРРРРРРРРРРРРРРРРРРРРРРРРРРРРРРР
# Sample Output 3:
# 31

# 1 вариант
# n = 'ООООООРРРОРОРРРРРРР'
# o = 0
# om = 0 #максимальное
# p = 0
# pm = 0 #максимальное
# for i in n:
#   if i == 'О':
#     o += 1
#     om = o #максимальное
#     p = 0 #обнуляется Р
#   elif i == 'Р':
#     p += 1
#     pm = p #максимальное
#     o = 0 #обнуляется О

# print(max(om, pm))

# 1 вариант
import random

num_try = int(input("Введите количеств бросков монеток = "))

string = ""
for i in range(num_try):
  string += random.choice(["Р","О"])

print(string)

max = 0
count = 1
i = 0

while "Р" * i in string:
  i += 1
print(i - 1)
# print("Р" not in ["Р","О"])
print(i in ["Р","О"])